ExchangePlans/МобильноеПриложениеЗаказыКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<ExchangePlan>
		<Properties>
			<Name>МобильноеПриложениеЗаказыКлиентов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиPushУведомлений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтправкиPushУведомлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНастройкиОбмена</Name>
					<Type>
						<v8:Type>cfg:ExchangePlanRef.МобильноеПриложениеЗаказыКлиентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПодписчикаДоставляемыхУведомлений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьAPNS</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьGCM</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючСервераОтправителяGCM</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинСервисаПередачиPushУведомлений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>54</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПриложенияGoogleCloud</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрефиксДляДанныхМобильногоУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертификатМобильногоПриложенияIOS</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиРеквизитовОбмена</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

ExchangePlans/МобильноеПриложениеЗаказыКлиентов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Если ЭтотУзел Тогда
			Наименование = НСтр("ru='Центральный';uk='Центральний'");
		Иначе
			ТекстНаименование = НСтр("ru='%Пользователь% (""Заказы"")';uk='%Пользователь% (""Замовлення"")'");
			ТекстНаименование = СтрЗаменить(ТекстНаименование, "%Пользователь%", СокрЛП(Пользователь));
			Наименование = ТекстНаименование;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Код) Тогда
		Если ЭтотУзел Тогда
			Код = "001";
		Иначе
			НовыйКод = СокрЛП(Пользователь.УникальныйИдентификатор());
			ПроверитьНовыйКод(НовыйКод, ЭтотОбъект.Ссылка, Отказ);
			Если Отказ Тогда
				Сообщение = НСтр("ru='Для пользователя ""%Пользователь%"" уже существует настройка,
|которая еще не была задействована для синхронизации данных с мобильным приложением.
|Используйте ее для настройки обмена данными.'
|;uk='Для користувача ""%Пользователь%"" вже існує настройка,
|яка ще не була задіяна для синхронізації даних з мобільним додатком.
|Використайте її для настройки обміну даними.'");
				Сообщение = СтрЗаменить(Сообщение, "%Пользователь%", Пользователь);
				Поле = "Пользователь";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение, ЭтотОбъект, Поле,, Отказ);
				Возврат;
			Иначе
				Код = НовыйКод;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЭтотУзел Тогда
		
		ПрефиксИспользуется = МобильноеПриложениеЗаказыКлиентовПереопределяемый.ПроверитьПрефиксДляДанныхМобильногоУстройства(
		Ссылка, ПрефиксДляДанныхМобильногоУстройства);
		
		Если ПрефиксИспользуется Тогда
			Сообщение = НСтр("ru='Префикс ""%Префикс%"" уже используется !';uk='Префікс ""%Префикс%"" вже використовується !'");
			Сообщение = СтрЗаменить(Сообщение, "%Префикс%", ПрефиксДляДанныхМобильногоУстройства);
			Поле = "ПрефиксДляДанныхМобильногоУстройства";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение, ЭтотОбъект, Поле,, Отказ);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	ДобавитьНепроверяемыеРеквизитыВМассив(МассивНепроверяемыхРеквизитов);
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Код = "";
	Наименование = "";
	ПрефиксДляДанныхМобильногоУстройства = "";
	ИдентификаторПодписчикаДоставляемыхУведомлений = Неопределено;
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПланыОбмена.УдалитьРегистрациюИзменений(Ссылка);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтотУзел И ЗначениеЗаполнено(Ссылка) И НЕ ПометкаУдаления
		И Код = СокрЛП(Пользователь.УникальныйИдентификатор()) Тогда
		ПланыОбмена.ЗарегистрироватьИзменения(Ссылка, Метаданные.Справочники.Партнеры);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьНепроверяемыеРеквизитыВМассив(МассивНепроверяемыхРеквизитов)
	
	Если Ссылка = ПланыОбмена.МобильноеПриложениеЗаказыКлиентов.ЭтотУзел() Тогда
		МассивНепроверяемыхРеквизитов.Добавить("Пользователь");
		МассивНепроверяемыхРеквизитов.Добавить("ПрефиксДляДанныхМобильногоУстройства");
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов.Добавить("Код");
	МассивНепроверяемыхРеквизитов.Добавить("Наименование");
	
КонецПроцедуры

Процедура ПроверитьНовыйКод(НовыйКод, СсылкаНаОбъект, Отказ)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	МобильноеПриложениеЗаказыКлиентов.Ссылка
	|ИЗ
	|	ПланОбмена.МобильноеПриложениеЗаказыКлиентов КАК МобильноеПриложениеЗаказыКлиентов
	|ГДЕ
	|	НЕ МобильноеПриложениеЗаказыКлиентов.Ссылка = &СсылкаНаОбъект
	|	И МобильноеПриложениеЗаказыКлиентов.Код = &Код");
	
	Запрос.УстановитьПараметр("СсылкаНаОбъект", СсылкаНаОбъект);
	Запрос.УстановитьПараметр("Код", НовыйКод);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
